app/views/games/new.html.erb

		   <div  class='row'>
		  	<div class="col-md-4"><%= select_tag 'user_id',options_for_select(User.all.map{|a| ["#{a.name}-#{a.try(:mobile)}",a.id]}),:style => 'width: 200px;'%>
---
SELECT `users`.* FROM `users`