app/controllers/games_controller.rb

  def index
  	@games = Leader.includes(:user)
---
SELECT `leaders`.* FROM `leaders`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)