app/controllers/users_controller.rb

  def new
  	@user = User.new
  	@users = User.all
---
SELECT `users`.* FROM `users`

  def create
  	user = User.new(user_params)
  	if user.save!
---
INSERT INTO "users" ("name", "mobile", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sara"], ["mobile", "sara"], ["created_at", "2017-11-16 11:45:59.808809"], ["updated_at", "2017-11-16 11:45:59.808809"]]

  def edit
  	@user = User.where(id: params[:id]).first
  	@users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT `users`.* FROM `users`

  def destroy
  	user = User.where(id: params[:id]).first
  	if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def update
  	user = User.where(:id => params[:id]).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]